# **********モンスターのディクショナリ定義**********
# 敵モンスター
slime = {
    'name':'スライム', 'hp':100, 'max_hp':100, 'element':'水', 'ap':10, 'dp':1
}

goburin = {
    'name':'ゴブリン', 'hp':200, 'max_hp':200, 'element':'土', 'ap':20, 'dp':5
}

ookoumori = {
    'name':'オオコウモリ', 'hp':300, 'max_hp':300, 'element':'風', 'ap':30, 'dp':10
}

wearwolf = {
    'name':'ウェアウルフ', 'hp':400, 'max_hp':400, 'element':'風', 'ap':40, 'dp':15
}

dragon = {
    'name':'ドラゴン', 'hp':600, 'max_hp':600, 'element':'火', 'ap':50, 'dp':20
}

# ダンジョンに出現する敵モンスターのリスト
monster_list = [slime,goburin,ookoumori,wearwolf,dragon]

# 味方モンスター
seiryu = {
    'name':'青龍', 'hp':150, 'max_hp':150, 'element':'風', 'ap':15, 'dp':10
}

suzaku = {
    'name':'朱雀', 'hp':150, 'max_hp':150, 'element':'火', 'ap':25, 'dp':10
}

byakko = {
    'name':'白虎', 'hp':150, 'max_hp':150, 'element':'土', 'ap':20, 'dp':5
}

genbu = {
    'name':'玄武', 'hp':150, 'max_hp':150, 'element':'水', 'ap':20, 'dp':15
}

# プレイヤーが編成可能な味方モンスターのリスト
friends = [seiryu,suzaku,byakko,genbu]

# ***********属性と記号の対応**********
ELEMENT_SYMBOLS = {
    '火':'$', '水':'~', '風':'@', '土':'#', '命':'&', '無':' '
}

# ***********属性と色コードの対応**********
ELEMENT_COLORS = {
    '火':1, # 赤
    '水':6, # 水色
    '風':2, # 緑
    '土':3, # 黄色
    '命':5, # 紫
    '無':7  # 黒
}

# ***********ランダムな宝石生成用の番号と記号の対応**********
ELEMENT_NUMBERS = {
    1:'$', 2:'~', 3:'@', 4:'#', 5:'&',
    }

# ***********宝石スロットの位置（A-N）とインデックスの対応**********
ELEMENT_POSITIONS = {
    'A':1, 'B':2, 'C':3, 'D':4, 'E':5, 'F':6, 'G':7,
    'H':8, 'I':9, 'J':10, 'K':11, 'L':12, 'M':13, 'N':14
    }

# **********宝石スロットのリスト（バトル開始時に初期化される）**********
gems_slot = []

# **********属性の強弱関係（攻撃側属性：防御側属性）**********
ELEMENT_BOOST = {
    '水': {'火': 2.0, '土': 0.5},
    '火': {'風': 2.0, '水': 0.5},
    '風': {'土': 2.0, '火': 0.5},
    '土': {'水': 2.0, '風': 0.5},
    '命': {}, # 命属性に強弱関係はない
    '無': {}, # 無属性に強弱関係はない
}